trainings = {
    'Чаховський': {
        'посада': 'Розробник',
        'коеф.еффект': '78.65',
        'ост.проекти': ['Пакман', 'Риба-їжак', 'Морква']
    },
    'Просів': {
        'посада' : 'Дизайнер',
        'коеф.еффект': '85.67',
        'ост.проекти': ['Життя', 'Мафія', 'Сильний']
    },
    'Райшев': {
        'посада' : 'Менеджер',
        'коеф.еффект': '64.45',
        'ост.проекти': ['Карта', 'Вперед!', 'Вперед2']
    }
}
print('Тренінги ProTeam')
print('1-прізвища працівників, 2-інфо про працівників, 3-найвищий коеф.еффект')
a = input('Номер дії (off-вийти):')
while a != 'off':
    if int(a) == 1:
        for training in trainings:
            print('-', training)
    if int(a) == 2:
        b = input('Прізвище працівника:')
        if b in trainings:
            for tr in trainings[b]:
                print(trainings[b][tr])
        else:
            print('Такого робытника не існує!')
    if int(a) == 3:
        print('Найвищий коеф.еффект у Просіва, аж 85.67!')
    a = input('Номер дії (off-вийти):')
